lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
#include <stddef.h>
#include <stdbool.h>
#include <stdint.h>

#include "nrf54l15_vpr_transport_shared.h"

#ifndef VPR_CS_DEDICATED_IMAGE
#define VPR_CS_DEDICATED_IMAGE 0
#endif

#define VPRCSR_NORDIC_VPRNORDICCTRL 0x7C0U
#define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL 0x7C1U
#define VPRCSR_NORDIC_TASKS 0x7E0U
#define VPRCSR_NORDIC_EVENTS 0x7E2U
#define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Msk (1UL << 0U)
#define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Pos 16U
#define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Enabled 0x507DUL
#define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_HIBERNATE 0xFU
#define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_STACKONSLEEP_Msk (1UL << 17U)

#define BLE_CS_MAIN_MODE1 0x01U
#define BLE_CS_MAIN_MODE2 0x02U

#define BLE_CS_HCI_OP_READ_REMOTE_SUPPORTED_CAPABILITIES 0x208AU
#define BLE_CS_HCI_OP_SECURITY_ENABLE 0x208CU
#define BLE_CS_HCI_OP_SET_DEFAULT_SETTINGS 0x208DU
#define BLE_CS_HCI_OP_CREATE_CONFIG 0x2090U
#define BLE_CS_HCI_OP_REMOVE_CONFIG 0x2091U
#define BLE_CS_HCI_OP_SET_PROCEDURE_PARAMETERS 0x2093U
#define BLE_CS_HCI_OP_PROCEDURE_ENABLE 0x2094U
#if !VPR_CS_DEDICATED_IMAGE
#define VPR_HCI_OP_VENDOR_PING 0xFCF0U
#define VPR_HCI_OP_VENDOR_GET_TRANSPORT_INFO 0xFCF1U
#define VPR_HCI_OP_VENDOR_FNV1A32 0xFCF2U
#define VPR_HCI_OP_VENDOR_GET_CAPABILITIES 0xFCF3U
#define VPR_HCI_OP_VENDOR_CRC32 0xFCF4U
#define VPR_HCI_OP_VENDOR_CRC32C 0xFCF5U
#define VPR_HCI_OP_VENDOR_TICKER_CONFIGURE 0xFCF6U
#define VPR_HCI_OP_VENDOR_TICKER_READ_STATE 0xFCF7U
#define VPR_HCI_OP_VENDOR_ENTER_HIBERNATE 0xFCF8U
#define VPR_HCI_OP_VENDOR_TICKER_EVENT_CONFIGURE 0xFCF9U
#define VPR_HCI_OP_VENDOR_BLE_LEGACY_ADV_CONFIGURE 0xFCFAU
#define VPR_HCI_OP_VENDOR_BLE_LEGACY_ADV_READ_STATE 0xFCFBU
#define VPR_HCI_OP_VENDOR_BLE_LEGACY_ADV_WRITE_DATA 0xFCFCU
#define VPR_HCI_OP_VENDOR_BLE_LEGACY_ADV_READ_DATA 0xFCFDU
#define VPR_HCI_OP_VENDOR_BLE_CONNECTION_CONFIGURE 0xFCE0U
#define VPR_HCI_OP_VENDOR_BLE_CONNECTION_READ_STATE 0xFCE1U
#define VPR_HCI_OP_VENDOR_BLE_CONNECTION_DISCONNECT 0xFCE2U
#define VPR_HCI_OP_VENDOR_BLE_CS_LINK_CONFIGURE 0xFCE3U
#define VPR_HCI_OP_VENDOR_BLE_CS_LINK_READ_STATE 0xFCE4U

#define VPR_VENDOR_SERVICE_VERSION_MAJOR 1U
#define VPR_VENDOR_SERVICE_VERSION_MINOR 11U
#define VPR_VENDOR_OP_PING (1UL << 0U)
#define VPR_VENDOR_OP_INFO (1UL << 1U)
#define VPR_VENDOR_OP_FNV1A32 (1UL << 2U)
#define VPR_VENDOR_OP_CAPABILITIES (1UL << 3U)
#define VPR_VENDOR_OP_CRC32 (1UL << 4U)
#define VPR_VENDOR_OP_CRC32C (1UL << 5U)
#define VPR_VENDOR_OP_TICKER_CONFIGURE (1UL << 6U)
#define VPR_VENDOR_OP_TICKER_READ_STATE (1UL << 7U)
#define VPR_VENDOR_OP_ENTER_HIBERNATE (1UL << 8U)
#define VPR_VENDOR_OP_TICKER_EVENT_CONFIGURE (1UL << 9U)
#define VPR_VENDOR_OP_BLE_LEGACY_ADV_CONFIGURE (1UL << 10U)
#define VPR_VENDOR_OP_BLE_LEGACY_ADV_READ_STATE (1UL << 11U)
#define VPR_VENDOR_OP_BLE_LEGACY_ADV_EVENT (1UL << 12U)
#define VPR_VENDOR_OP_BLE_LEGACY_ADV_WRITE_DATA (1UL << 13U)
#define VPR_VENDOR_OP_BLE_LEGACY_ADV_READ_DATA (1UL << 14U)
#define VPR_VENDOR_OP_BLE_CONNECTION_CONFIGURE (1UL << 15U)
#define VPR_VENDOR_OP_BLE_CONNECTION_READ_STATE (1UL << 16U)
#define VPR_VENDOR_OP_BLE_CONNECTION_EVENT (1UL << 17U)
#define VPR_VENDOR_OP_BLE_CS_LINK_CONFIGURE (1UL << 18U)
#define VPR_VENDOR_OP_BLE_CS_LINK_READ_STATE (1UL << 19U)
#define VPR_VENDOR_TRANSPORT_FLAG_RESTORED_FROM_HIBERNATE 0x80U
#define VPR_VENDOR_EVENT_TICKER 0xA0U
#define VPR_VENDOR_EVENT_BLE_LEGACY_ADV 0xA1U
#define VPR_VENDOR_EVENT_BLE_CONNECTION 0xA2U
#endif
#define VPR_VENDOR_EVENT_CS_PEER_RESULT_TRIGGER 0xB1U
#define VPR_VENDOR_EVENT_CS_PEER_RESULT_SOURCE 0xB2U
#if !VPR_CS_DEDICATED_IMAGE
#define VPR_TICKER_EVENT_QUEUE_DEPTH 8U
#define VPR_BLE_LEGACY_ADV_EVENT_QUEUE_DEPTH 8U
#define VPR_BLE_CONNECTION_EVENT_QUEUE_DEPTH 8U
#endif

#define BLE_CS_HCI_EVT_READ_REMOTE_SUPPORTED_CAPS_COMPLETE_V2 0x38U
#define BLE_CS_HCI_EVT_SECURITY_ENABLE_COMPLETE 0x2EU
#define BLE_CS_HCI_EVT_CONFIG_COMPLETE 0x2FU
#define BLE_CS_HCI_EVT_PROCEDURE_ENABLE_COMPLETE 0x30U
#define BLE_CS_HCI_EVT_SUBEVENT_RESULT 0x31U
#define BLE_CS_HCI_EVT_SUBEVENT_RESULT_CONTINUE 0x32U

#define BLE_HCI_PACKET_TYPE_EVENT 0x04U
#define BLE_HCI_EVT_COMMAND_COMPLETE 0x0EU
#define BLE_HCI_EVT_COMMAND_STATUS 0x0FU
#define BLE_HCI_EVT_LE_META 0x3EU
#define BLE_HCI_EVT_VENDOR 0xFFU

extern uint8_t __stack_top[];

static volatile Nrf54l15VprTransportHostShared* const g_host_transport =
    (volatile Nrf54l15VprTransportHostShared*)(uintptr_t)NRF54L15_VPR_TRANSPORT_HOST_BASE;
static volatile Nrf54l15VprTransportVprShared* const g_vpr_transport =
    (volatile Nrf54l15VprTransportVprShared*)(uintptr_t)NRF54L15_VPR_TRANSPORT_VPR_BASE;

typedef struct {
  uint32_t count;
  uint32_t step;
  uint32_t heartbeat;
  uint32_t sequence;
  uint8_t flags;
} vpr_ticker_event_entry_t;

typedef struct {
  uint32_t eventCount;
  uint32_t heartbeat;
  uint32_t randomDelayTicks;
  uint32_t sequence;
  uint8_t flags;
  uint8_t channelMask;
} vpr_ble_legacy_adv_event_entry_t;

typedef struct {
  uint32_t eventCount;
  uint32_t disconnectCount;
  uint32_t sequence;
  uint16_t connHandle;
  uint16_t intervalUnits;
  uint16_t latency;
  uint16_t supervisionTimeout;
  uint8_t flags;
  uint8_t reason;
  uint8_t role;
  uint8_t encrypted;
  uint8_t txPhy;
  uint8_t rxPhy;
} vpr_ble_connection_event_entry_t;

#if !VPR_CS_DEDICATED_IMAGE
static uint32_t g_ticker_enabled = 0U;
static uint32_t g_ticker_period_ticks = 0U;
static uint32_t g_ticker_step = 1U;
static uint32_t g_ticker_accum = 0U;
static uint32_t g_ticker_count = 0U;
static uint32_t g_ticker_event_enabled = 0U;
static uint32_t g_ticker_event_emit_every = 0U;
static uint32_t g_ticker_event_last_emitted_count = 0U;
static uint32_t g_ticker_event_sequence = 0U;
static uint32_t g_ticker_event_drop_count = 0U;
static vpr_ticker_event_entry_t g_ticker_event_queue[VPR_TICKER_EVENT_QUEUE_DEPTH];
static uint32_t g_ticker_event_queue_head = 0U;
static uint32_t g_ticker_event_queue_tail = 0U;
static uint32_t g_ticker_event_queue_count = 0U;
static uint32_t g_ble_legacy_adv_enabled = 0U;
static uint32_t g_ble_legacy_adv_interval_ticks = 0U;
static uint32_t g_ble_legacy_adv_event_count = 0U;
static uint32_t g_ble_legacy_adv_next_heartbeat = 0U;
static uint32_t g_ble_legacy_adv_last_random_delay_ticks = 0U;
static uint32_t g_ble_legacy_adv_event_sequence = 0U;
static uint32_t g_ble_legacy_adv_event_drop_count = 0U;
static uint8_t g_ble_legacy_adv_channel_mask = 0x07U;
static uint8_t g_ble_legacy_adv_last_channel_mask = 0U;
static uint8_t g_ble_legacy_adv_next_channel_index = 0U;
static uint8_t g_ble_legacy_adv_add_random_delay = 0U;
static uint8_t g_ble_legacy_adv_data_len = 0U;
static uint8_t g_ble_legacy_adv_data[31];
static vpr_ble_legacy_adv_event_entry_t
    g_ble_legacy_adv_event_queue[VPR_BLE_LEGACY_ADV_EVENT_QUEUE_DEPTH];
static uint32_t g_ble_legacy_adv_event_queue_head = 0U;
static uint32_t g_ble_legacy_adv_event_queue_tail = 0U;
static uint32_t g_ble_legacy_adv_event_queue_count = 0U;
static uint32_t g_ble_connection_connected = 0U;
static uint32_t g_ble_connection_event_count = 0U;
static uint32_t g_ble_connection_disconnect_count = 0U;
static uint32_t g_ble_connection_event_sequence = 0U;
static uint32_t g_ble_connection_event_drop_count = 0U;
static uint16_t g_ble_connection_conn_handle = 0U;
static uint16_t g_ble_connection_interval_units = 0U;
static uint16_t g_ble_connection_latency = 0U;
static uint16_t g_ble_connection_supervision_timeout = 0U;
static uint8_t g_ble_connection_role = 0U;
static uint8_t g_ble_connection_encrypted = 0U;
static uint8_t g_ble_connection_tx_phy = 0U;
static uint8_t g_ble_connection_rx_phy = 0U;
static uint8_t g_ble_connection_last_event_flags = 0U;
static uint8_t g_ble_connection_last_disconnect_reason = 0U;
static uint8_t g_ble_cs_link_bound = 0U;
static vpr_ble_connection_event_entry_t
    g_ble_connection_event_queue[VPR_BLE_CONNECTION_EVENT_QUEUE_DEPTH];
static uint32_t g_ble_connection_event_queue_head = 0U;
static uint32_t g_ble_connection_event_queue_tail = 0U;
static uint32_t g_ble_connection_event_queue_count = 0U;
#endif
static uint8_t g_pending_cs_result_stage = 0U;
#if VPR_CS_DEDICATED_IMAGE
static uint32_t g_cs_next_procedure_heartbeat = 0U;
static uint32_t g_cs_next_subevent_heartbeat = 0U;
static uint32_t g_cs_next_peer_stage_heartbeat = 0U;
static uint32_t g_cs_next_chunk_stage_heartbeat = 0U;
static uint8_t g_cs_last_peer_gap_ticks = 0U;
static uint8_t g_cs_last_interval_selector = 0U;
static uint8_t g_cs_active_subevent_index = 0U;
static uint8_t g_cs_local_chunk_start_step = 0U;
static uint8_t g_cs_peer_chunk_start_step = 0U;
typedef struct __attribute__((packed)) {
  uint8_t configId;
  uint16_t procedureCounter;
  uint16_t sessionConnHandle;
  uint32_t demoChannelsPacked;
  uint8_t mainModeType;
  uint8_t subModeType;
  uint8_t minMainModeSteps;
  uint8_t maxMainModeSteps;
  uint8_t mainModeRepetition;
  uint8_t mode0Steps;
  uint8_t role;
  uint8_t rttType;
  uint8_t csSyncPhy;
  uint8_t channelMap[10];
  uint8_t channelMapRepetition;
  uint8_t channelSelectionType;
  uint8_t ch3cShape;
  uint8_t ch3cJump;
  uint8_t enhancements1;
  int8_t maxTxPowerDbm;
  uint16_t maxProcedureLen;
  uint16_t minProcedureInterval;
  uint16_t maxProcedureInterval;
  uint16_t maxProcedureCount;
  uint32_t minSubeventLen;
  uint32_t maxSubeventLen;
  uint8_t toneAntennaConfigSelection;
  uint8_t phy;
  int8_t txPowerDelta;
  uint8_t configCreated;
  uint8_t securityEnabled;
  uint8_t procedureParamsApplied;
  uint8_t procedureEnabled;
  uint8_t sessionOpen;
  uint8_t lastEvictedConfigId;
} vpr_cs_dedicated_state_t;

