lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
typedef struct {
  uint8_t inUse;
  uint8_t configId;
  uint32_t demoChannelsPacked;
  uint8_t mainModeType;
  uint8_t subModeType;
  uint8_t minMainModeSteps;
  uint8_t maxMainModeSteps;
  uint8_t mainModeRepetition;
  uint8_t mode0Steps;
  uint8_t role;
  uint8_t rttType;
  uint8_t csSyncPhy;
  uint8_t channelMap[10];
  uint8_t channelMapRepetition;
  uint8_t channelSelectionType;
  uint8_t ch3cShape;
  uint8_t ch3cJump;
  uint8_t enhancements1;
  uint16_t maxProcedureLen;
  uint16_t minProcedureInterval;
  uint16_t maxProcedureInterval;
  uint16_t maxProcedureCount;
  uint32_t minSubeventLen;
  uint32_t maxSubeventLen;
  uint8_t toneAntennaConfigSelection;
  uint8_t phy;
  int8_t txPowerDelta;
  uint8_t securityEnabled;
  uint8_t procedureParamsApplied;
} vpr_cs_config_slot_t;

static vpr_cs_dedicated_state_t g_cs_state = {
    .configId = 1U,
    .procedureCounter = 0U,
    .sessionConnHandle = 0U,
    .demoChannelsPacked = 0x241A0E02U,
    .mainModeType = BLE_CS_MAIN_MODE2,
    .subModeType = 0xFFU,
    .minMainModeSteps = 3U,
    .maxMainModeSteps = 5U,
    .mainModeRepetition = 1U,
    .mode0Steps = 1U,
    .role = 0U,
    .rttType = 1U,
    .csSyncPhy = 2U,
    .channelMap = {0xFFU, 0xFFU, 0xFFU, 0xFFU, 0x1FU,
                   0x00U, 0x00U, 0x00U, 0x00U, 0x00U},
    .channelMapRepetition = 1U,
    .channelSelectionType = 1U,
    .ch3cShape = 1U,
    .ch3cJump = 3U,
    .enhancements1 = 0x01U,
    .maxTxPowerDbm = -8,
    .maxProcedureLen = 12U,
    .minProcedureInterval = 200U,
    .maxProcedureInterval = 300U,
    .maxProcedureCount = 8U,
    .minSubeventLen = 0x000456UL,
    .maxSubeventLen = 0x000678UL,
    .toneAntennaConfigSelection = 2U,
    .phy = 2U,
    .txPowerDelta = -6,
    .configCreated = 0U,
    .securityEnabled = 0U,
    .procedureParamsApplied = 0U,
    .procedureEnabled = 0U,
    .sessionOpen = 0U,
};
static vpr_cs_config_slot_t g_cs_slots[2];
static vpr_cs_config_slot_t g_cs_previous_slot;

#define g_cs_config_id g_cs_state.configId
#define g_cs_procedure_counter g_cs_state.procedureCounter
#define g_cs_session_conn_handle g_cs_state.sessionConnHandle
#define g_cs_demo_channels_packed g_cs_state.demoChannelsPacked
#define g_cs_main_mode_type g_cs_state.mainModeType
#define g_cs_sub_mode_type g_cs_state.subModeType
#define g_cs_min_main_mode_steps g_cs_state.minMainModeSteps
#define g_cs_max_main_mode_steps g_cs_state.maxMainModeSteps
#define g_cs_main_mode_repetition g_cs_state.mainModeRepetition
#define g_cs_mode0_steps g_cs_state.mode0Steps
#define g_cs_role g_cs_state.role
#define g_cs_rtt_type g_cs_state.rttType
#define g_cs_cs_sync_phy g_cs_state.csSyncPhy
#define g_cs_channel_map g_cs_state.channelMap
#define g_cs_channel_map_repetition g_cs_state.channelMapRepetition
#define g_cs_channel_selection_type g_cs_state.channelSelectionType
#define g_cs_ch3c_shape g_cs_state.ch3cShape
#define g_cs_ch3c_jump g_cs_state.ch3cJump
#define g_cs_enhancements1 g_cs_state.enhancements1
#define g_cs_max_tx_power_dbm g_cs_state.maxTxPowerDbm
#define g_cs_max_procedure_len g_cs_state.maxProcedureLen
#define g_cs_min_procedure_interval g_cs_state.minProcedureInterval
#define g_cs_max_procedure_interval g_cs_state.maxProcedureInterval
#define g_cs_max_procedure_count g_cs_state.maxProcedureCount
#define g_cs_min_subevent_len g_cs_state.minSubeventLen
#define g_cs_max_subevent_len g_cs_state.maxSubeventLen
#define g_cs_tone_antenna_config_selection g_cs_state.toneAntennaConfigSelection
#define g_cs_phy g_cs_state.phy
#define g_cs_tx_power_delta g_cs_state.txPowerDelta
#define g_cs_config_created g_cs_state.configCreated
#define g_cs_security_enabled g_cs_state.securityEnabled
#define g_cs_procedure_params_applied g_cs_state.procedureParamsApplied
#define g_cs_procedure_enabled g_cs_state.procedureEnabled
#define g_cs_session_open g_cs_state.sessionOpen
#define g_cs_last_evicted_config_id g_cs_state.lastEvictedConfigId
#else
static uint32_t g_cs_next_procedure_heartbeat = 0U;
static uint32_t g_cs_next_subevent_heartbeat = 0U;
static uint32_t g_cs_next_peer_stage_heartbeat = 0U;
static uint32_t g_cs_next_chunk_stage_heartbeat = 0U;
static uint8_t g_cs_last_peer_gap_ticks = 0U;
static uint8_t g_cs_last_interval_selector = 0U;
static uint8_t g_cs_active_subevent_index = 0U;
static uint8_t g_cs_local_chunk_start_step = 0U;
static uint8_t g_cs_peer_chunk_start_step = 0U;
static uint8_t g_cs_config_id = 1U;
static uint16_t g_cs_procedure_counter = 0U;
static uint16_t g_cs_session_conn_handle = 0U;
static uint32_t g_cs_demo_channels_packed = 0x241A0E02U;
static uint8_t g_cs_main_mode_type = BLE_CS_MAIN_MODE2;
static uint8_t g_cs_sub_mode_type = 0xFFU;
static uint8_t g_cs_min_main_mode_steps = 3U;
static uint8_t g_cs_max_main_mode_steps = 5U;
static uint8_t g_cs_main_mode_repetition = 1U;
static uint8_t g_cs_mode0_steps = 1U;
static uint8_t g_cs_role = 0U;
static uint8_t g_cs_rtt_type = 1U;
static uint8_t g_cs_cs_sync_phy = 2U;
static uint8_t g_cs_channel_map[10] = {0xFFU, 0xFFU, 0xFFU, 0xFFU, 0x1FU,
                                       0x00U, 0x00U, 0x00U, 0x00U, 0x00U};
static uint8_t g_cs_channel_map_repetition = 1U;
static uint8_t g_cs_channel_selection_type = 1U;
static uint8_t g_cs_ch3c_shape = 1U;
static uint8_t g_cs_ch3c_jump = 3U;
static uint8_t g_cs_enhancements1 = 0x01U;
static int8_t g_cs_max_tx_power_dbm = -8;
static uint16_t g_cs_max_procedure_len = 12U;
static uint16_t g_cs_min_procedure_interval = 200U;
static uint16_t g_cs_max_procedure_interval = 300U;
static uint16_t g_cs_max_procedure_count = 8U;
static uint32_t g_cs_min_subevent_len = 0x000456UL;
static uint32_t g_cs_max_subevent_len = 0x000678UL;
static uint8_t g_cs_tone_antenna_config_selection = 2U;
static uint8_t g_cs_phy = 2U;
static int8_t g_cs_tx_power_delta = -6;
static uint8_t g_cs_config_created = 0U;
static uint8_t g_cs_security_enabled = 0U;
static uint8_t g_cs_procedure_params_applied = 0U;
static uint8_t g_cs_procedure_enabled = 0U;
static uint8_t g_cs_session_open = 0U;
static uint8_t g_cs_last_evicted_config_id = 0U;
#endif
#if !VPR_CS_DEDICATED_IMAGE
static uint32_t g_pending_hibernate = 0U;
static uint32_t g_restored_from_hibernate = 0U;
#endif

static bool host_request_pending(void);

#if VPR_CS_DEDICATED_IMAGE
enum {
  BLE_CS_HCI_STATUS_SUCCESS = 0x00U,
  BLE_CS_HCI_STATUS_COMMAND_DISALLOWED = 0x0CU,
  BLE_CS_HCI_STATUS_INVALID_PARAMS = 0x12U,
};

static void clear_active_cs_state(void);
static uint32_t pack_demo_channels_from_map(const uint8_t *channel_map);
static vpr_cs_config_slot_t *find_cs_slot(uint8_t config_id);
static vpr_cs_config_slot_t *allocate_cs_slot(uint8_t config_id);
static vpr_cs_config_slot_t *promote_previous_slot_to_primary(bool preserve_displaced);
static void clear_cs_slot(vpr_cs_config_slot_t *slot);
static bool any_cs_slot_in_use(void);
static bool has_free_cs_slot(void);
static bool load_active_state_from_slot(const vpr_cs_config_slot_t *slot);
static void store_active_create_state(vpr_cs_config_slot_t *slot);
static void store_active_procedure_state(vpr_cs_config_slot_t *slot);
static void preserve_active_state_to_slot(void);
static void clear_active_runtime_state(void);
static void clear_active_config_selection(void);
static void clear_all_cs_state(void);
#endif

static inline void fence_rw(void) {
  __asm__ volatile("fence rw, rw" ::: "memory");
}

static inline void enable_machine_interrupts(void) {
  const uint32_t mie_mask = 0x8U;
  __asm__ volatile("csrs mstatus, %0" : : "r"(mie_mask) : "memory");
}

static inline void write_vpr_sleepctrl(uint32_t value) {
  __asm__ volatile("csrw %0, %1" : : "i"(VPRCSR_NORDIC_VPRNORDICSLEEPCTRL), "r"(value));
}

static inline void write_vpr_nordic_ctrl(uint32_t value) {
  __asm__ volatile("csrw %0, %1" : : "i"(VPRCSR_NORDIC_VPRNORDICCTRL), "r"(value));
}

static void bytes_zero(void *dst, size_t len) {
  uint8_t *out = (uint8_t *)dst;
  if (out == NULL) {
    return;
  }
  for (size_t i = 0U; i < len; ++i) {
    out[i] = 0U;
  }
}

static void bytes_copy(void *dst, const void *src, size_t len) {
  uint8_t *out = (uint8_t *)dst;
  const uint8_t *in = (const uint8_t *)src;
  if (out == NULL || in == NULL) {
    return;
  }
  for (size_t i = 0U; i < len; ++i) {
    out[i] = in[i];
  }
}

#if VPR_CS_DEDICATED_IMAGE
static void reset_dedicated_cs_state(void) {
  g_cs_config_id = 1U;
  g_cs_procedure_counter = 0U;
  g_cs_session_conn_handle = 0U;
  g_cs_demo_channels_packed = 0x241A0E02U;
  g_cs_main_mode_type = BLE_CS_MAIN_MODE2;
  g_cs_sub_mode_type = 0xFFU;
  g_cs_min_main_mode_steps = 3U;
  g_cs_max_main_mode_steps = 5U;
  g_cs_main_mode_repetition = 1U;
  g_cs_mode0_steps = 1U;
  g_cs_role = 0U;
  g_cs_rtt_type = 1U;
  g_cs_cs_sync_phy = 2U;
  g_cs_channel_map[0] = 0xFFU;
  g_cs_channel_map[1] = 0xFFU;
  g_cs_channel_map[2] = 0xFFU;
  g_cs_channel_map[3] = 0xFFU;
  g_cs_channel_map[4] = 0x1FU;
  g_cs_channel_map[5] = 0x00U;
  g_cs_channel_map[6] = 0x00U;
  g_cs_channel_map[7] = 0x00U;
  g_cs_channel_map[8] = 0x00U;
  g_cs_channel_map[9] = 0x00U;
  g_cs_channel_map_repetition = 1U;
  g_cs_channel_selection_type = 1U;
  g_cs_ch3c_shape = 1U;
  g_cs_ch3c_jump = 3U;
  g_cs_enhancements1 = 0x01U;
  g_cs_max_tx_power_dbm = -8;
  g_cs_max_procedure_len = 12U;
  g_cs_min_procedure_interval = 200U;
  g_cs_max_procedure_interval = 300U;
  g_cs_max_procedure_count = 8U;
  g_cs_min_subevent_len = 0x000456UL;
  g_cs_max_subevent_len = 0x000678UL;
  g_cs_tone_antenna_config_selection = 2U;
  g_cs_phy = 2U;
  g_cs_tx_power_delta = -6;
  g_cs_config_created = 0U;
  g_cs_security_enabled = 0U;
  g_cs_procedure_params_applied = 0U;
  g_cs_procedure_enabled = 0U;
  g_cs_session_open = 0U;
  g_cs_last_evicted_config_id = 0U;
  g_cs_next_procedure_heartbeat = 0U;
  g_cs_next_subevent_heartbeat = 0U;
  g_cs_next_peer_stage_heartbeat = 0U;
  g_cs_next_chunk_stage_heartbeat = 0U;
  g_cs_last_peer_gap_ticks = 0U;
  g_cs_last_interval_selector = 0U;
  g_cs_active_subevent_index = 0U;
  g_cs_local_chunk_start_step = 0U;
  g_cs_peer_chunk_start_step = 0U;
}
#endif

static void zero_vpr_data(void) {
  for (uint32_t i = 0U; i < NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA; ++i) {
    g_vpr_transport->vprData[i] = 0U;
  }
}

