lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
#if !VPR_CS_DEDICATED_IMAGE
static void clear_ticker_event_queue(void) {
  bytes_zero(g_ticker_event_queue, sizeof(g_ticker_event_queue));
  g_ticker_event_queue_head = 0U;
  g_ticker_event_queue_tail = 0U;
  g_ticker_event_queue_count = 0U;
}

static bool enqueue_ticker_event(uint32_t count, uint32_t step, uint32_t heartbeat) {
  if (g_ticker_event_queue_count >= VPR_TICKER_EVENT_QUEUE_DEPTH) {
    g_ticker_event_drop_count = g_ticker_event_drop_count + 1U;
    return false;
  }
  vpr_ticker_event_entry_t *entry = &g_ticker_event_queue[g_ticker_event_queue_tail];
  entry->flags = 0U;
  entry->count = count;
  entry->step = step;
  entry->heartbeat = heartbeat;
  g_ticker_event_sequence = g_ticker_event_sequence + 1U;
  entry->sequence = g_ticker_event_sequence;
  g_ticker_event_queue_tail = (g_ticker_event_queue_tail + 1U) % VPR_TICKER_EVENT_QUEUE_DEPTH;
  g_ticker_event_queue_count = g_ticker_event_queue_count + 1U;
  g_ticker_event_last_emitted_count = count;
  return true;
}

static void clear_ble_legacy_adv_event_queue(void) {
  bytes_zero(g_ble_legacy_adv_event_queue, sizeof(g_ble_legacy_adv_event_queue));
  g_ble_legacy_adv_event_queue_head = 0U;
  g_ble_legacy_adv_event_queue_tail = 0U;
  g_ble_legacy_adv_event_queue_count = 0U;
}

static uint8_t normalize_ble_legacy_adv_channel_mask(uint8_t mask) {
  mask = (uint8_t)(mask & 0x07U);
  if (mask == 0U) {
    mask = 0x01U;
  }
  return mask;
}

static uint8_t pick_next_ble_legacy_adv_channel(uint8_t mask) {
  mask = normalize_ble_legacy_adv_channel_mask(mask);
  for (uint8_t offset = 0U; offset < 3U; ++offset) {
    const uint8_t candidate_index =
        (uint8_t)((g_ble_legacy_adv_next_channel_index + offset) % 3U);
    const uint8_t candidate_mask = (uint8_t)(1U << candidate_index);
    if ((mask & candidate_mask) != 0U) {
      g_ble_legacy_adv_next_channel_index = (uint8_t)((candidate_index + 1U) % 3U);
      return candidate_mask;
    }
  }
  g_ble_legacy_adv_next_channel_index = 1U;
  return 0x01U;
}

static uint32_t ble_legacy_adv_random_delay_ticks(uint32_t heartbeat,
                                                  uint32_t event_count,
                                                  uint32_t interval_ticks) {
  if (g_ble_legacy_adv_add_random_delay == 0U || interval_ticks == 0U) {
    return 0U;
  }
  uint32_t max_extra = interval_ticks / 8U;
  if (max_extra < 64U) {
    max_extra = 64U;
  }
  if (max_extra > 16000U) {
    max_extra = 16000U;
  }
  const uint32_t seed = (heartbeat * 1103515245UL) ^ (event_count * 2654435761UL);
  return seed % (max_extra + 1U);
}

static bool enqueue_ble_legacy_adv_event(uint8_t channel_mask,
                                         uint32_t event_count,
                                         uint32_t heartbeat,
                                         uint32_t random_delay_ticks) {
  if (g_ble_legacy_adv_event_queue_count >= VPR_BLE_LEGACY_ADV_EVENT_QUEUE_DEPTH) {
    g_ble_legacy_adv_event_drop_count = g_ble_legacy_adv_event_drop_count + 1U;
    return false;
  }
  vpr_ble_legacy_adv_event_entry_t *entry =
      &g_ble_legacy_adv_event_queue[g_ble_legacy_adv_event_queue_tail];
  entry->flags = random_delay_ticks != 0U ? 0x01U : 0x00U;
  entry->channelMask = channel_mask;
  entry->eventCount = event_count;
  entry->heartbeat = heartbeat;
  entry->randomDelayTicks = random_delay_ticks;
  g_ble_legacy_adv_event_sequence = g_ble_legacy_adv_event_sequence + 1U;
  entry->sequence = g_ble_legacy_adv_event_sequence;
  g_ble_legacy_adv_event_queue_tail =
      (g_ble_legacy_adv_event_queue_tail + 1U) % VPR_BLE_LEGACY_ADV_EVENT_QUEUE_DEPTH;
  g_ble_legacy_adv_event_queue_count = g_ble_legacy_adv_event_queue_count + 1U;
  return true;
}

static void clear_ble_connection_event_queue(void) {
  bytes_zero(g_ble_connection_event_queue, sizeof(g_ble_connection_event_queue));
  g_ble_connection_event_queue_head = 0U;
  g_ble_connection_event_queue_tail = 0U;
  g_ble_connection_event_queue_count = 0U;
}

static bool enqueue_ble_connection_event(uint8_t flags,
                                         uint8_t reason) {
  if (g_ble_connection_event_queue_count >= VPR_BLE_CONNECTION_EVENT_QUEUE_DEPTH) {
    g_ble_connection_event_drop_count = g_ble_connection_event_drop_count + 1U;
    return false;
  }
  vpr_ble_connection_event_entry_t *entry =
      &g_ble_connection_event_queue[g_ble_connection_event_queue_tail];
  entry->flags = flags;
  entry->reason = reason;
  entry->connHandle = g_ble_connection_conn_handle;
  entry->role = g_ble_connection_role;
  entry->encrypted = g_ble_connection_encrypted;
  entry->intervalUnits = g_ble_connection_interval_units;
  entry->latency = g_ble_connection_latency;
  entry->supervisionTimeout = g_ble_connection_supervision_timeout;
  entry->txPhy = g_ble_connection_tx_phy;
  entry->rxPhy = g_ble_connection_rx_phy;
  entry->eventCount = g_ble_connection_event_count;
  entry->disconnectCount = g_ble_connection_disconnect_count;
  g_ble_connection_last_event_flags = flags;
  g_ble_connection_last_disconnect_reason = reason;
  g_ble_connection_event_sequence = g_ble_connection_event_sequence + 1U;
  entry->sequence = g_ble_connection_event_sequence;
  g_ble_connection_event_queue_tail =
      (g_ble_connection_event_queue_tail + 1U) % VPR_BLE_CONNECTION_EVENT_QUEUE_DEPTH;
  g_ble_connection_event_queue_count = g_ble_connection_event_queue_count + 1U;
  return true;
}

static uint8_t ble_cs_link_runnable(void) {
  return (uint8_t)((g_ble_cs_link_bound != 0U && g_ble_connection_connected != 0U &&
                    g_ble_connection_conn_handle != 0U &&
                    g_ble_connection_encrypted != 0U)
                       ? 1U
                       : 0U);
}

static uint32_t current_ble_connection_state_packed(uint32_t host_flags) {
  uint32_t packed = 0U;
  if ((host_flags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U) {
    packed |= NRF54L15_VPR_TRANSPORT_FLAG_PENDING;
  }
  if (g_restored_from_hibernate != 0U) {
    packed |= 0x00000002UL;
  }
  if (g_ble_connection_connected != 0U) {
    packed |= 0x00000004UL;
  }
  if (g_ble_connection_encrypted != 0U) {
    packed |= 0x00000008UL;
  }
  if (g_ble_cs_link_bound != 0U) {
    packed |= 0x00000010UL;
  }
  if (ble_cs_link_runnable() != 0U) {
    packed |= 0x00000020UL;
  }
  packed |= ((uint32_t)g_ble_connection_role & 0xFFU) << 8U;
  packed |= ((uint32_t)g_ble_connection_conn_handle & 0xFFFFU) << 16U;
  return packed;
}

