lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static void current_authority_config_ids(uint8_t *out0, uint8_t *out1, uint8_t *out2) {
  uint8_t ids[4] = {0U, 0U, 0U, 0U};
  uint8_t count = 0U;
  if (g_cs_config_created != 0U && g_cs_config_id != 0U) {
    (void)append_unique_config_id(g_cs_config_id, ids, &count);
  }
  if (g_cs_slots[0].inUse != 0U) {
    (void)append_unique_config_id(g_cs_slots[0].configId, ids, &count);
  }
  if (g_cs_slots[1].inUse != 0U) {
    (void)append_unique_config_id(g_cs_slots[1].configId, ids, &count);
  }
  if (g_cs_previous_slot.inUse != 0U) {
    (void)append_unique_config_id(g_cs_previous_slot.configId, ids, &count);
  }
  if (out0 != NULL) {
    *out0 = ids[0];
  }
  if (out1 != NULL) {
    *out1 = ids[1];
  }
  if (out2 != NULL) {
    *out2 = ids[2];
  }
}

static uint32_t current_link_state_aux_packed(void) {
  uint8_t authority2 = 0U;
  current_authority_config_ids(NULL, NULL, &authority2);
  return ((uint32_t)(current_unique_cs_config_count() & 0x0FU)) |
         (((uint32_t)g_cs_last_peer_gap_ticks & 0x0FU) << 8U) |
         (((uint32_t)g_cs_last_evicted_config_id & 0xFFU) << 16U) |
         (((uint32_t)authority2 & 0xFFU) << 24U);
}

static uint32_t current_link_state_meta_packed(void) {
  uint8_t slot0_config_id = 0U;
  uint8_t slot1_config_id = 0U;
  uint8_t previous_config_id = 0U;
  uint8_t flags = 0U;
  uint8_t free_primary_slot_count = 0U;

  if (g_cs_slots[0].inUse != 0U) {
    slot0_config_id = g_cs_slots[0].configId;
    flags |= 0x01U;
  } else {
    ++free_primary_slot_count;
  }
  if (g_cs_slots[1].inUse != 0U) {
    slot1_config_id = g_cs_slots[1].configId;
    flags |= 0x02U;
  } else {
    ++free_primary_slot_count;
  }
  if (g_cs_previous_slot.inUse != 0U) {
    previous_config_id = g_cs_previous_slot.configId;
    flags |= 0x04U;
  }
  if (g_cs_config_created != 0U && slot0_config_id == g_cs_config_id) {
    flags |= 0x08U;
  }
  if (g_cs_config_created != 0U && slot1_config_id == g_cs_config_id) {
    flags |= 0x10U;
  }
  if (g_cs_config_created != 0U && previous_config_id == g_cs_config_id) {
    flags |= 0x20U;
  }
  flags |= (uint8_t)((free_primary_slot_count & 0x03U) << 6U);

  return (uint32_t)slot0_config_id | ((uint32_t)slot1_config_id << 8U) |
         ((uint32_t)previous_config_id << 16U) | ((uint32_t)flags << 24U);
}

static uint32_t current_link_state_config_packed(void) {
  uint32_t flags = 0U;
  uint8_t authority0 = 0U;
  uint8_t authority1 = 0U;
  current_authority_config_ids(&authority0, &authority1, NULL);

  if (g_cs_slots[0].inUse != 0U && g_cs_slots[0].securityEnabled != 0U &&
      g_cs_slots[0].procedureParamsApplied != 0U) {
    flags |= 0x01U;
  }
  if (g_cs_slots[1].inUse != 0U && g_cs_slots[1].securityEnabled != 0U &&
      g_cs_slots[1].procedureParamsApplied != 0U) {
    flags |= 0x02U;
  }
  if (g_cs_previous_slot.inUse != 0U && g_cs_previous_slot.securityEnabled != 0U &&
      g_cs_previous_slot.procedureParamsApplied != 0U) {
    flags |= 0x04U;
  }
  if (g_cs_config_created != 0U && g_cs_security_enabled != 0U &&
      g_cs_procedure_params_applied != 0U) {
    flags |= 0x08U;
  }
  if (g_cs_slots[0].inUse != 0U && g_cs_slots[0].securityEnabled != 0U) {
    flags |= 0x10U;
  }
  if (g_cs_slots[1].inUse != 0U && g_cs_slots[1].securityEnabled != 0U) {
    flags |= 0x20U;
  }
  if (g_cs_previous_slot.inUse != 0U && g_cs_previous_slot.securityEnabled != 0U) {
    flags |= 0x40U;
  }
  if (g_cs_config_created != 0U && g_cs_security_enabled != 0U) {
    flags |= 0x80U;
  }
  if (g_cs_slots[0].inUse != 0U && g_cs_slots[0].procedureParamsApplied != 0U) {
    flags |= 0x100U;
  }
  if (g_cs_slots[1].inUse != 0U && g_cs_slots[1].procedureParamsApplied != 0U) {
    flags |= 0x200U;
  }
  if (g_cs_previous_slot.inUse != 0U && g_cs_previous_slot.procedureParamsApplied != 0U) {
    flags |= 0x400U;
  }
  if (g_cs_config_created != 0U && g_cs_procedure_params_applied != 0U) {
    flags |= 0x800U;
  }
  flags |= ((uint32_t)authority0 << 12U);
  flags |= ((uint32_t)authority1 << 20U);

  return flags;
}

static bool command_conn_handle_matches_active_link(void) {
  return (g_cs_session_open != 0U) && (read_conn_handle() == g_cs_session_conn_handle);
}
#endif

static size_t append_h4_command_status(uint8_t *dst, size_t max_len, uint16_t opcode,
                                       uint8_t status) {
  if (dst == NULL || max_len < 7U) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_COMMAND_STATUS;
  dst[2] = 4U;
  dst[3] = status;
  dst[4] = 1U;
  write_le16(&dst[5], opcode);
  return 7U;
}

static size_t append_h4_command_complete(uint8_t *dst, size_t max_len, uint16_t opcode,
                                         uint8_t status) {
  if (dst == NULL || max_len < 7U) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_COMMAND_COMPLETE;
  dst[2] = 4U;
  dst[3] = 1U;
  write_le16(&dst[4], opcode);
  dst[6] = status;
  return 7U;
}

static size_t append_h4_command_complete_payload(uint8_t *dst, size_t max_len,
                                                 uint16_t opcode, const uint8_t *payload,
                                                 size_t payload_len) {
  if (dst == NULL || (payload_len != 0U && payload == NULL) || max_len < (6U + payload_len)) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_COMMAND_COMPLETE;
  dst[2] = (uint8_t)(3U + payload_len);
  dst[3] = 1U;
  write_le16(&dst[4], opcode);
  bytes_copy(&dst[6], payload, payload_len);
  return 6U + payload_len;
}

static size_t append_h4_le_meta(uint8_t *dst, size_t max_len, uint8_t subevent_code,
                                const uint8_t *payload, size_t payload_len) {
  if (dst == NULL || payload == NULL || max_len < (4U + payload_len)) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_LE_META;
  dst[2] = (uint8_t)(1U + payload_len);
  dst[3] = subevent_code;
  bytes_copy(&dst[4], payload, payload_len);
  return 4U + payload_len;
}

static size_t append_h4_vendor_event(uint8_t *dst, size_t max_len, uint8_t subevent_code,
                                     const uint8_t *payload, size_t payload_len) {
  if (dst == NULL || payload == NULL || max_len < (4U + payload_len)) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_VENDOR;
  dst[2] = (uint8_t)(1U + payload_len);
  dst[3] = subevent_code;
  bytes_copy(&dst[4], payload, payload_len);
  return 4U + payload_len;
}

