lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static void append_mode2_demo_step(uint8_t *dst, uint8_t channel, uint8_t step_index) {
#if VPR_CS_DEDICATED_IMAGE
  uint8_t scaled_pct[3];
  uint8_t shaped_pct[3];
  scale_pct_sample_bytes(k_local_demo_pct_sample, current_local_demo_scale_q10(step_index),
                         scaled_pct);
  rotate_pct_sample_bytes_quarter_turns(scaled_pct, current_local_demo_phase_quadrant(step_index),
                                        shaped_pct);
  append_mode2_sample_step(dst, channel, current_demo_antenna_permutation(step_index),
                           ((step_index & 0x01U) != 0U) ? VPR_CS_TONE_QUALITY_MEDIUM
                                                        : VPR_CS_TONE_QUALITY_HIGH,
                           shaped_pct);
#else
  append_mode2_sample_step(dst, channel, current_demo_antenna_permutation(step_index),
                           ((step_index & 0x01U) != 0U) ? VPR_CS_TONE_QUALITY_MEDIUM
                                                        : VPR_CS_TONE_QUALITY_HIGH,
                           k_local_demo_pct_sample);
#endif
}

#if VPR_CS_DEDICATED_IMAGE
static void append_mode2_peer_demo_step(uint8_t *dst, uint8_t channel, uint8_t step_index) {
  uint8_t scaled_pct[3];
  uint8_t shaped_pct[3];
  const uint8_t *pct =
      (channel < 39U) ? k_peer_demo_pct_samples[channel] : k_local_demo_pct_sample;
  const uint8_t phase_quadrant = current_local_demo_phase_quadrant(step_index);
  scale_pct_sample_bytes(pct, current_peer_demo_scale_q10(channel, step_index), scaled_pct);
  rotate_pct_sample_bytes_quarter_turns(scaled_pct, (uint8_t)((4U - phase_quadrant) & 0x03U),
                                        shaped_pct);
  append_mode2_sample_step(dst, channel, current_demo_antenna_permutation(step_index),
                           ((step_index & 0x01U) != 0U) ? VPR_CS_TONE_QUALITY_MEDIUM
                                                        : VPR_CS_TONE_QUALITY_HIGH,
                           shaped_pct);
}

static bool channel_map_bit_enabled(const uint8_t *channel_map, uint8_t bit) {
  if (channel_map == NULL || bit >= 80U) {
    return false;
  }
  return (channel_map[bit >> 3U] & (uint8_t)(1U << (bit & 0x07U))) != 0U;
}

static bool channel_map_has_enabled_channels(const uint8_t *channel_map) {
  if (channel_map == NULL) {
    return false;
  }
  for (uint8_t i = 0U; i < 10U; ++i) {
    if (channel_map[i] != 0U) {
      return true;
    }
  }
  return false;
}

static uint16_t current_channel_selection_group(void) {
  uint16_t procedure_index = (g_cs_procedure_counter > 0U) ? (uint16_t)(g_cs_procedure_counter - 1U)
                                                           : 0U;
  if (g_cs_channel_map_repetition > 1U) {
    procedure_index = (uint16_t)(procedure_index / g_cs_channel_map_repetition);
  }
  return procedure_index;
}

static uint16_t current_step_count_group(void) {
  uint16_t procedure_index = (g_cs_procedure_counter > 0U) ? (uint16_t)(g_cs_procedure_counter - 1U)
                                                           : 0U;
  if (g_cs_main_mode_repetition > 1U) {
    procedure_index = (uint16_t)(procedure_index / g_cs_main_mode_repetition);
  }
  return procedure_index;
}

static uint8_t current_demo_num_antenna_paths(void);
static size_t current_demo_total_encoded_step_bytes(void);
static size_t append_local_demo_step(uint8_t *dst, const uint8_t *channels,
                                     uint8_t step_index);

static uint8_t current_demo_step_count(void) {
  uint8_t min_steps = (g_cs_min_main_mode_steps != 0U) ? g_cs_min_main_mode_steps : 1U;
  uint8_t max_steps = (g_cs_max_main_mode_steps >= min_steps) ? g_cs_max_main_mode_steps
                                                              : min_steps;
  uint8_t count = min_steps;
  if (max_steps > min_steps) {
    const uint8_t span = (uint8_t)(max_steps - min_steps + 1U);
    count = (uint8_t)(min_steps + (current_step_count_group() % span));
  }
  if (count > 6U) {
    count = 6U;
  }
  return count;
}

static bool current_demo_has_mode1_timing_step(void) {
  return (g_cs_rtt_type != 0U) && (current_demo_step_count() > 3U);
}

static uint8_t current_demo_total_step_count(void) {
  return (uint8_t)(current_demo_step_count() + (current_demo_has_mode1_timing_step() ? 1U : 0U));
}

static size_t current_demo_subevent_policy_budget_bytes(void) {
#if VPR_CS_DEDICATED_IMAGE
  if (g_cs_max_subevent_len <= 0x000180UL) {
    return 24U;
  }
  if (g_cs_max_subevent_len <= 0x000300UL) {
    return 32U;
  }
  return 40U;
#else
  return 40U;
#endif
}

static uint8_t current_demo_subevent_count(void) {
#if VPR_CS_DEDICATED_IMAGE
  const uint8_t total_steps = current_demo_total_step_count();
  if (total_steps <= 6U) {
    return 1U;
  }
  const size_t total_bytes = current_demo_total_encoded_step_bytes();
  const size_t budget_bytes = current_demo_subevent_policy_budget_bytes();
  uint8_t count =
      (uint8_t)((total_bytes + budget_bytes - 1U) / budget_bytes);
  if (count < 2U) {
    count = 2U;
  }
  if (count > 3U) {
    count = 3U;
  }
  return count;
#else
  return 1U;
#endif
}

static uint8_t current_demo_subevent_start_step(uint8_t subevent_index) {
  const uint8_t total_steps = current_demo_total_step_count();
  const uint8_t subevent_count = current_demo_subevent_count();
  if (subevent_count <= 1U || subevent_index == 0U) {
    return 0U;
  }
  if (subevent_index >= subevent_count) {
    return total_steps;
  }

  uint8_t start = 0U;
  for (uint8_t i = 0U; i < subevent_index; ++i) {
    const uint8_t remaining_steps = (uint8_t)(total_steps - start);
    const uint8_t remaining_subevents = (uint8_t)(subevent_count - i);
    start = (uint8_t)(start +
                      ((uint8_t)((remaining_steps + remaining_subevents - 1U) /
                                 remaining_subevents)));
  }
  return start;
}

static uint8_t current_demo_subevent_step_count(uint8_t subevent_index) {
  const uint8_t total_steps = current_demo_total_step_count();
  const uint8_t start = current_demo_subevent_start_step(subevent_index);
  if (start >= total_steps) {
    return 0U;
  }
  const uint8_t next_start = current_demo_subevent_start_step((uint8_t)(subevent_index + 1U));
  return (next_start > start) ? (uint8_t)(next_start - start)
                              : (uint8_t)(total_steps - start);
}

