lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static size_t current_demo_encoded_step_len(uint8_t step_index) {
  return (current_demo_has_mode1_timing_step() && step_index == 0U) ? 9U : 8U;
}

static size_t current_demo_total_encoded_step_bytes_for_range(uint8_t start_step_index,
                                                              uint8_t step_count) {
  size_t total = 0U;
  const uint8_t end_step_index = (uint8_t)(start_step_index + step_count);
  for (uint8_t step_index = start_step_index; step_index < end_step_index; ++step_index) {
    total += current_demo_encoded_step_len(step_index);
  }
  return total;
}

static size_t current_demo_total_encoded_step_bytes(void) {
  return current_demo_total_encoded_step_bytes_for_range(0U, current_demo_total_step_count());
}

static size_t current_demo_subevent_encoded_step_bytes(uint8_t subevent_index) {
  return current_demo_total_encoded_step_bytes_for_range(
      current_demo_subevent_start_step(subevent_index),
      current_demo_subevent_step_count(subevent_index));
}

static uint8_t current_demo_phase_step_index(uint8_t step_index) {
  return (uint8_t)(step_index - (current_demo_has_mode1_timing_step() ? 1U : 0U));
}

static size_t append_local_demo_step(uint8_t *dst, const uint8_t *channels, uint8_t step_index) {
  if (dst == NULL || channels == NULL) {
    return 0U;
  }
  if (current_demo_has_mode1_timing_step() && step_index == 0U) {
    return append_mode1_unavailable_step(dst, channels[0], current_demo_num_antenna_paths());
  }
  const uint8_t phase_step_index = current_demo_phase_step_index(step_index);
  append_mode2_demo_step(dst, channels[phase_step_index], phase_step_index);
  return 8U;
}

static size_t append_peer_demo_step(uint8_t *dst, const uint8_t *channels, uint8_t step_index) {
  if (dst == NULL || channels == NULL) {
    return 0U;
  }
  if (current_demo_has_mode1_timing_step() && step_index == 0U) {
    return append_mode1_unavailable_step(dst, channels[0], current_demo_num_antenna_paths());
  }
  const uint8_t phase_step_index = current_demo_phase_step_index(step_index);
  append_mode2_peer_demo_step(dst, channels[phase_step_index], phase_step_index);
  return 8U;
}

static uint8_t count_demo_steps_for_budget(size_t budget, uint8_t start_step_index,
                                           uint8_t end_step_index) {
  size_t used = 0U;
  uint8_t count = 0U;
  for (uint8_t step_index = start_step_index; step_index < end_step_index; ++step_index) {
    const size_t step_len = current_demo_encoded_step_len(step_index);
    if (used + step_len > budget) {
      break;
    }
    used += step_len;
    ++count;
  }
  return count;
}

static size_t current_demo_initial_chunk_budget(uint8_t subevent_index) {
#if VPR_CS_DEDICATED_IMAGE
  if (current_demo_subevent_encoded_step_bytes(subevent_index) > 32U) {
    if (g_cs_min_subevent_len <= 0x000180UL) {
      return 9U;
    }
    return 17U;
  }
#endif
  return 25U;
}

static size_t current_demo_continue_chunk_budget(uint8_t subevent_index,
                                                 uint8_t start_step_index) {
  (void)start_step_index;
#if VPR_CS_DEDICATED_IMAGE
  if (current_demo_subevent_encoded_step_bytes(subevent_index) > 32U) {
    if (g_cs_min_subevent_len <= 0x000180UL) {
      return 8U;
    }
    return 16U;
  }
#endif
  return 32U;
}

static uint16_t current_demo_acl_event_counter(void) {
  return (uint16_t)(0x1200U + (current_channel_selection_group() * 0x10U) +
                    current_step_count_group());
}

static uint16_t current_demo_frequency_compensation(void) {
  return (uint16_t)(0x0010U + ((current_channel_selection_group() & 0x0FU) << 2U) +
                    (current_step_count_group() & 0x03U));
}

static int8_t current_demo_reference_power_dbm(void) {
  int16_t dbm = (int16_t)g_cs_max_tx_power_dbm + (int16_t)g_cs_tx_power_delta;
  if (dbm < -127) {
    dbm = -127;
  }
  if (dbm > 20) {
    dbm = 20;
  }
  return (int8_t)dbm;
}

static uint8_t current_demo_num_antenna_paths(void) {
  uint8_t count = g_cs_tone_antenna_config_selection;
  if (count == 0U) {
    count = 1U;
  }
  if (count > 4U) {
    count = 4U;
  }
  return count;
}

static uint32_t pack_demo_channels_from_map(const uint8_t *channel_map) {
  uint8_t channels[4];
  uint8_t found = 0U;
  uint8_t last = 2U;
  uint32_t packed = 0U;

  if (channel_map == NULL) {
    return 0U;
  }

  for (uint8_t bit = 0U; bit < 80U && found < 4U; ++bit) {
    if (channel_map_bit_enabled(channel_map, bit)) {
      last = bit;
      channels[found++] = bit;
    }
  }
  if (found == 0U) {
    return 0U;
  }
  for (uint8_t i = found; i < 4U; ++i) {
    channels[i] = last;
  }
  for (uint8_t i = 0U; i < 4U; ++i) {
    packed |= ((uint32_t)channels[i] << (8U * i));
  }
  return packed;
}

static vpr_cs_config_slot_t *find_cs_slot(uint8_t config_id) {
  for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
    if (g_cs_slots[i].inUse != 0U && g_cs_slots[i].configId == config_id) {
      return &g_cs_slots[i];
    }
  }
  if (g_cs_previous_slot.inUse != 0U && g_cs_previous_slot.configId == config_id) {
    return &g_cs_previous_slot;
  }
  return NULL;
}

static vpr_cs_config_slot_t *find_cs_primary_slot(uint8_t config_id) {
  for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
    if (g_cs_slots[i].inUse != 0U && g_cs_slots[i].configId == config_id) {
      return &g_cs_slots[i];
    }
  }
  return NULL;
}

static vpr_cs_config_slot_t *allocate_cs_slot(uint8_t config_id) {
  vpr_cs_config_slot_t *slot = find_cs_primary_slot(config_id);
  if (slot != NULL) {
    return slot;
  }
  for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
    if (g_cs_slots[i].inUse == 0U) {
      bytes_zero(&g_cs_slots[i], sizeof(g_cs_slots[i]));
      g_cs_slots[i].inUse = 1U;
      g_cs_slots[i].configId = config_id;
      return &g_cs_slots[i];
    }
  }
  return NULL;
}

static bool can_allocate_create_config_slot(uint8_t config_id) {
  if (find_cs_slot(config_id) != NULL) {
    return true;
  }
  if (has_free_cs_slot()) {
    return true;
  }
  return (g_cs_config_created != 0U) && (find_cs_primary_slot(g_cs_config_id) != NULL);
}

