lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static void update_demo_channels_from_create_config(void) {
  uint8_t channel_map[10];
  if (g_host_transport->hostLen < 32U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  bytes_copy(channel_map, (const void *)&g_host_transport->hostData[17], sizeof(channel_map));
  {
    const uint32_t packed = pack_demo_channels_from_map(channel_map);
    if (packed != 0U) {
      g_cs_demo_channels_packed = packed;
    }
  }
}

static void update_defaults_from_set_default_settings(void) {
  if (g_host_transport->hostLen < 9U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  g_cs_max_tx_power_dbm = (int8_t)g_host_transport->hostData[8];
}

static void update_create_config_from_command(void) {
  vpr_cs_config_slot_t *slot = NULL;
  const bool allow_previous_overflow =
      (g_cs_config_created != 0U) && (find_cs_primary_slot(g_cs_config_id) != NULL);
  if (g_host_transport->hostLen < 32U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  preserve_active_state_to_slot();
  g_cs_config_id = g_host_transport->hostData[6];
  g_cs_main_mode_type = g_host_transport->hostData[8];
  g_cs_sub_mode_type = g_host_transport->hostData[9];
  g_cs_min_main_mode_steps = g_host_transport->hostData[10];
  g_cs_max_main_mode_steps = g_host_transport->hostData[11];
  g_cs_main_mode_repetition = g_host_transport->hostData[12];
  g_cs_mode0_steps = g_host_transport->hostData[13];
  g_cs_role = g_host_transport->hostData[14];
  g_cs_rtt_type = g_host_transport->hostData[15];
  g_cs_cs_sync_phy = g_host_transport->hostData[16];
  bytes_copy(g_cs_channel_map, (const void *)&g_host_transport->hostData[17], sizeof(g_cs_channel_map));
  g_cs_channel_map_repetition = g_host_transport->hostData[27];
  g_cs_channel_selection_type = g_host_transport->hostData[28];
  g_cs_ch3c_shape = g_host_transport->hostData[29];
  g_cs_ch3c_jump = g_host_transport->hostData[30];
  g_cs_enhancements1 = g_host_transport->hostData[31];
  g_cs_config_created = 1U;
  g_cs_security_enabled = 0U;
  g_cs_procedure_params_applied = 0U;
  g_cs_procedure_enabled = 0U;
  g_pending_cs_result_stage = 0U;
  g_cs_procedure_counter = 0U;
  g_cs_next_procedure_heartbeat = 0U;
  g_cs_next_subevent_heartbeat = 0U;
  g_cs_next_peer_stage_heartbeat = 0U;
  g_cs_next_chunk_stage_heartbeat = 0U;
  g_cs_last_interval_selector = 0U;
  g_cs_last_peer_gap_ticks = 0U;
  g_cs_active_subevent_index = 0U;
  g_cs_local_chunk_start_step = 0U;
  g_cs_peer_chunk_start_step = 0U;
  update_demo_channels_from_create_config();
  slot = allocate_create_config_slot(g_cs_config_id, allow_previous_overflow);
  if (slot != NULL) {
    store_active_create_state(slot);
    slot->securityEnabled = 0U;
    slot->procedureParamsApplied = 0U;
  }
}

static uint8_t validate_create_config_command(void) {
  const vpr_cs_config_slot_t *existing_slot = NULL;
  if (g_host_transport->hostLen < 32U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }

  const uint8_t config_id = g_host_transport->hostData[6];
  const uint8_t min_steps = g_host_transport->hostData[10];
  const uint8_t max_steps = g_host_transport->hostData[11];
  const uint8_t repetition = g_host_transport->hostData[12];
  const uint8_t mode0_steps = g_host_transport->hostData[13];
  const uint8_t cs_sync_phy = g_host_transport->hostData[16];

  if (config_id == 0U || min_steps == 0U || max_steps < min_steps ||
      repetition == 0U || mode0_steps == 0U || cs_sync_phy == 0U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!channel_map_has_enabled_channels((const uint8_t *)&g_host_transport->hostData[17])) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  existing_slot = find_cs_slot(config_id);
  if (existing_slot == NULL && !can_allocate_create_config_slot(config_id)) {
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static void update_procedure_params_from_command(void) {
  vpr_cs_config_slot_t *slot = NULL;
  const uint8_t requested_config_id =
      (g_host_transport->hostLen >= 7U) ? g_host_transport->hostData[6] : 0U;
  if (g_host_transport->hostLen < 27U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  if (requested_config_id != 0U && requested_config_id != g_cs_config_id) {
    (void)activate_stored_config_slot(requested_config_id, true);
  }
  g_cs_config_id = requested_config_id;
  g_cs_max_procedure_len = read_le16(&g_host_transport->hostData[7]);
  g_cs_min_procedure_interval = read_le16(&g_host_transport->hostData[9]);
  g_cs_max_procedure_interval = read_le16(&g_host_transport->hostData[11]);
  g_cs_max_procedure_count = read_le16(&g_host_transport->hostData[13]);
  g_cs_min_subevent_len = read_le24(&g_host_transport->hostData[15]);
  g_cs_max_subevent_len = read_le24(&g_host_transport->hostData[18]);
  g_cs_tone_antenna_config_selection = g_host_transport->hostData[21];
  g_cs_phy = g_host_transport->hostData[22];
  g_cs_tx_power_delta = (int8_t)g_host_transport->hostData[23];
  g_cs_procedure_params_applied = 1U;
  g_cs_next_procedure_heartbeat = 0U;
  g_cs_next_subevent_heartbeat = 0U;
  g_cs_next_peer_stage_heartbeat = 0U;
  g_cs_next_chunk_stage_heartbeat = 0U;
  g_cs_last_interval_selector = 0U;
  g_cs_last_peer_gap_ticks = 0U;
  g_cs_active_subevent_index = 0U;
  g_cs_local_chunk_start_step = 0U;
  g_cs_peer_chunk_start_step = 0U;
  slot = find_cs_slot(g_cs_config_id);
  if (slot == NULL && g_cs_config_created != 0U) {
    slot = allocate_cs_slot(g_cs_config_id);
    if (slot != NULL) {
      store_active_create_state(slot);
    }
  }
  if (slot != NULL) {
    store_active_procedure_state(slot);
    if (slot == &g_cs_previous_slot) {
      (void)promote_previous_slot_to_primary(true);
    }
  }
}

static void clear_active_runtime_state(void) {
  g_cs_procedure_enabled = 0U;
  g_pending_cs_result_stage = 0U;
  g_cs_procedure_counter = 0U;
  g_cs_next_procedure_heartbeat = 0U;
  g_cs_next_subevent_heartbeat = 0U;
  g_cs_next_peer_stage_heartbeat = 0U;
  g_cs_next_chunk_stage_heartbeat = 0U;
  g_cs_last_interval_selector = 0U;
  g_cs_last_peer_gap_ticks = 0U;
  g_cs_active_subevent_index = 0U;
  g_cs_local_chunk_start_step = 0U;
  g_cs_peer_chunk_start_step = 0U;
}

static void clear_active_config_selection(void) {
  g_cs_config_created = 0U;
  g_cs_security_enabled = 0U;
  g_cs_procedure_params_applied = 0U;
  g_cs_config_id = 0U;
  g_cs_demo_channels_packed = 0U;
  clear_active_runtime_state();
}

static void clear_all_cs_state(void) {
  clear_active_config_selection();
  g_cs_last_evicted_config_id = 0U;
  for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
    clear_cs_slot(&g_cs_slots[i]);
  }
  clear_cs_slot(&g_cs_previous_slot);
}

static void clear_active_cs_state(void) {
  clear_all_cs_state();
  g_cs_session_conn_handle = 0U;
  g_cs_session_open = 0U;
}

static uint8_t validate_remove_config_command(void) {
  const vpr_cs_config_slot_t *slot = NULL;
  const uint8_t requested_config_id =
      (g_host_transport->hostLen >= 7U) ? g_host_transport->hostData[6] : 0U;
  const bool active_config =
      (g_cs_config_created != 0U) && (requested_config_id == g_cs_config_id);
  if (g_host_transport->hostLen < 7U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (!any_cs_slot_in_use()) {
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  slot = find_cs_slot(g_host_transport->hostData[6]);
  if (slot == NULL && !active_config) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static uint8_t validate_security_enable_command(void) {
  if (g_host_transport->hostLen < 6U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_cs_config_created == 0U) {
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static uint8_t validate_set_procedure_params_command(void) {
  const vpr_cs_config_slot_t *slot = NULL;
  const uint8_t requested_config_id =
      (g_host_transport->hostLen >= 27U) ? g_host_transport->hostData[6] : 0U;
  const bool active_config =
      (g_cs_config_created != 0U) && (requested_config_id == g_cs_config_id);
  bool security_enabled = false;
  if (g_host_transport->hostLen < 27U || g_host_transport->hostData[0] != 0x01U) {
    g_vpr_transport->lastError = 0xD1U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    g_vpr_transport->lastError = (g_cs_session_open != 0U) ? 0xD2U : 0xD3U;
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  slot = find_cs_slot(g_host_transport->hostData[6]);
  if (slot == NULL && !active_config) {
    g_vpr_transport->lastError = 0xD6U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  security_enabled =
      (slot != NULL) ? (slot->securityEnabled != 0U) : (g_cs_security_enabled != 0U);
  if (g_cs_config_created == 0U || !security_enabled) {
    g_vpr_transport->lastError =
        (g_cs_config_created == 0U) ? 0xD4U : 0xD5U;
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  {
    const uint16_t max_procedure_len = read_le16(&g_host_transport->hostData[7]);
    const uint16_t min_interval = read_le16(&g_host_transport->hostData[9]);
    const uint16_t max_interval = read_le16(&g_host_transport->hostData[11]);
    const uint16_t max_count = read_le16(&g_host_transport->hostData[13]);
    const uint32_t min_subevent_len = read_le24(&g_host_transport->hostData[15]);
    const uint32_t max_subevent_len = read_le24(&g_host_transport->hostData[18]);
    if (max_procedure_len == 0U || min_interval == 0U || max_interval < min_interval ||
        max_count == 0U || min_subevent_len == 0U ||
        max_subevent_len < min_subevent_len) {
      g_vpr_transport->lastError = 0xD7U;
      return BLE_CS_HCI_STATUS_INVALID_PARAMS;
    }
  }
  g_vpr_transport->lastError = 0U;
  return BLE_CS_HCI_STATUS_SUCCESS;
}

