lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static size_t build_vendor_ble_legacy_adv_write_data_complete_payload(uint8_t *payload,
                                                                      size_t max_len) {
  uint8_t status = 0x00U;
  if (g_host_transport->hostLen < 5U) {
    status = 0x12U;
  } else {
    const uint8_t len = g_host_transport->hostData[4];
    if (len > sizeof(g_ble_legacy_adv_data) ||
        g_host_transport->hostLen < (uint16_t)(5U + len)) {
      status = 0x12U;
    } else {
      g_ble_legacy_adv_data_len = len;
      if (len != 0U) {
        const uint8_t *host_data = (const uint8_t *)&g_host_transport->hostData[5];
        bytes_copy(g_ble_legacy_adv_data, host_data, len);
      }
      if (len < sizeof(g_ble_legacy_adv_data)) {
        bytes_zero(&g_ble_legacy_adv_data[len],
                   sizeof(g_ble_legacy_adv_data) - len);
      }
    }
  }
  return build_vendor_ble_legacy_adv_data_payload(payload, max_len, status);
}

static size_t build_vendor_ble_connection_configure_complete_payload(uint8_t *payload,
                                                                     size_t max_len) {
  uint8_t status = 0x00U;
  if (g_host_transport->hostLen < 16U) {
    status = 0x12U;
  } else {
    const uint16_t conn_handle =
        (uint16_t)g_host_transport->hostData[4] |
        ((uint16_t)g_host_transport->hostData[5] << 8U);
    const uint8_t role = g_host_transport->hostData[6];
    const uint8_t encrypted = g_host_transport->hostData[7] != 0U ? 1U : 0U;
    const uint16_t interval_units =
        (uint16_t)g_host_transport->hostData[8] |
        ((uint16_t)g_host_transport->hostData[9] << 8U);
    const uint16_t latency =
        (uint16_t)g_host_transport->hostData[10] |
        ((uint16_t)g_host_transport->hostData[11] << 8U);
    const uint16_t supervision_timeout =
        (uint16_t)g_host_transport->hostData[12] |
        ((uint16_t)g_host_transport->hostData[13] << 8U);
    const uint8_t tx_phy = g_host_transport->hostData[14];
    const uint8_t rx_phy = g_host_transport->hostData[15];
    if (conn_handle == 0U || interval_units == 0U || supervision_timeout == 0U) {
      status = 0x12U;
    } else if (g_ble_connection_connected != 0U &&
               g_ble_connection_conn_handle != conn_handle) {
      status = 0x0CU;
    } else {
      const uint8_t was_connected = (uint8_t)(g_ble_connection_connected != 0U ? 1U : 0U);
      g_ble_connection_connected = 1U;
      g_ble_connection_conn_handle = conn_handle;
      g_ble_connection_role = role;
      g_ble_connection_encrypted = encrypted;
      g_ble_connection_interval_units = interval_units;
      g_ble_connection_latency = latency;
      g_ble_connection_supervision_timeout = supervision_timeout;
      g_ble_connection_tx_phy = tx_phy;
      g_ble_connection_rx_phy = rx_phy;
      if (was_connected == 0U) {
        g_ble_connection_event_count = g_ble_connection_event_count + 1U;
        (void)enqueue_ble_connection_event(0x01U, 0x00U);
      }
    }
  }
  return build_vendor_ble_connection_state_payload(payload, max_len, status);
}

static size_t build_vendor_ble_connection_disconnect_complete_payload(uint8_t *payload,
                                                                      size_t max_len) {
  uint8_t status = 0x00U;
  if (g_host_transport->hostLen < 7U) {
    status = 0x12U;
  } else {
    const uint16_t conn_handle =
        (uint16_t)g_host_transport->hostData[4] |
        ((uint16_t)g_host_transport->hostData[5] << 8U);
    const uint8_t reason = g_host_transport->hostData[6];
    if (g_ble_connection_connected == 0U || g_ble_connection_conn_handle != conn_handle) {
      status = 0x02U;
    } else {
      g_ble_cs_link_bound = 0U;
      g_ble_connection_connected = 0U;
      g_ble_connection_event_count = g_ble_connection_event_count + 1U;
      g_ble_connection_disconnect_count = g_ble_connection_disconnect_count + 1U;
      (void)enqueue_ble_connection_event(0x02U, reason);
      g_ble_connection_conn_handle = 0U;
      g_ble_connection_role = 0U;
      g_ble_connection_encrypted = 0U;
      g_ble_connection_interval_units = 0U;
      g_ble_connection_latency = 0U;
      g_ble_connection_supervision_timeout = 0U;
      g_ble_connection_tx_phy = 0U;
      g_ble_connection_rx_phy = 0U;
    }
  }
  return build_vendor_ble_connection_state_payload(payload, max_len, status);
}

static size_t build_vendor_ble_cs_link_configure_complete_payload(uint8_t *payload,
                                                                  size_t max_len) {
  uint8_t status = 0x00U;
  if (g_host_transport->hostLen < 7U) {
    status = 0x12U;
  } else {
    const uint8_t enable = g_host_transport->hostData[4] != 0U ? 1U : 0U;
    const uint16_t conn_handle =
        (uint16_t)g_host_transport->hostData[5] |
        ((uint16_t)g_host_transport->hostData[6] << 8U);
    if (enable == 0U) {
      g_ble_cs_link_bound = 0U;
    } else if (g_ble_connection_connected == 0U || g_ble_connection_conn_handle == 0U ||
               g_ble_connection_conn_handle != conn_handle) {
      status = 0x02U;
    } else {
      g_ble_cs_link_bound = 1U;
    }
  }
  return build_vendor_ble_cs_link_state_payload(payload, max_len, status);
}

static size_t build_vendor_ble_legacy_adv_event_payload(
    uint8_t *payload, size_t max_len, const vpr_ble_legacy_adv_event_entry_t *event) {
  if (payload == NULL || event == NULL || max_len < 18U) {
    return 0U;
  }
  payload[0] = event->flags;
  payload[1] = event->channelMask;
  write_le32(&payload[2], event->eventCount);
  write_le32(&payload[6], event->heartbeat);
  write_le32(&payload[10], event->randomDelayTicks);
  write_le32(&payload[14], event->sequence);
  return 18U;
}

static size_t build_vendor_ble_connection_event_payload(
    uint8_t *payload, size_t max_len, const vpr_ble_connection_event_entry_t *event) {
  if (payload == NULL || event == NULL || max_len < 26U) {
    return 0U;
  }
  payload[0] = event->flags;
  write_le16(&payload[1], event->connHandle);
  payload[3] = event->reason;
  payload[4] = event->role;
  payload[5] = (uint8_t)(event->encrypted != 0U ? 1U : 0U);
  write_le16(&payload[6], event->intervalUnits);
  write_le16(&payload[8], event->latency);
  write_le16(&payload[10], event->supervisionTimeout);
  payload[12] = event->txPhy;
  payload[13] = event->rxPhy;
  write_le32(&payload[14], event->eventCount);
  write_le32(&payload[18], event->disconnectCount);
  write_le32(&payload[22], event->sequence);
  return 26U;
}

