lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static size_t build_vendor_enter_hibernate_complete_payload(uint8_t *payload, size_t max_len) {
  if (payload == NULL || max_len < 5U) {
    return 0U;
  }
  payload[0] = 0U;
  write_le32(&payload[1], g_vpr_transport->heartbeat);
  persist_hibernate_state();
  g_pending_hibernate = 1U;
  return 5U;
}
#else
static uint16_t read_opcode(void) {
  if (g_host_transport->hostLen < 4U) {
    return 0U;
  }
  if (g_host_transport->hostData[0] != 0x01U) {
    return 0U;
  }
  return (uint16_t)g_host_transport->hostData[1] |
         ((uint16_t)g_host_transport->hostData[2] << 8U);
}
#endif

static void build_unknown_command_response(uint16_t opcode) {
  zero_vpr_data();
  g_vpr_transport->vprData[0] = 0x04U;
  g_vpr_transport->vprData[1] = 0x0EU;
  g_vpr_transport->vprData[2] = 4U;
  g_vpr_transport->vprData[3] = 1U;
  g_vpr_transport->vprData[4] = (uint8_t)(opcode & 0xFFU);
  g_vpr_transport->vprData[5] = (uint8_t)((opcode >> 8U) & 0xFFU);
  g_vpr_transport->vprData[6] = 0x01U;
  g_vpr_transport->vprLen = 7U;
}

static bool publish_builtin_response_for_opcode(uint16_t opcode) {
  uint8_t payload[40];
  uint16_t conn_handle = current_conn_handle();
  size_t offset = 0U;
  zero_vpr_data();

  switch (opcode) {
    case BLE_CS_HCI_OP_READ_REMOTE_SUPPORTED_CAPABILITIES: {
      uint8_t status = 0U;
#if VPR_CS_DEDICATED_IMAGE
      status = validate_read_remote_caps_command();
      if (status == BLE_CS_HCI_STATUS_SUCCESS && g_cs_session_open == 0U) {
        clear_active_cs_state();
        g_cs_session_conn_handle = conn_handle;
        g_cs_session_open = 1U;
      }
#endif
      size_t len = append_h4_command_status((uint8_t *)g_vpr_transport->vprData + offset,
                                            NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                            opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      if (status != 0U) {
        break;
      }
      len = build_remote_caps_payload(payload, sizeof(payload), conn_handle);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_READ_REMOTE_SUPPORTED_CAPS_COMPLETE_V2, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_SET_DEFAULT_SETTINGS: {
#if VPR_CS_DEDICATED_IMAGE
      update_defaults_from_set_default_settings();
#endif
      size_t len = append_h4_command_complete((uint8_t *)g_vpr_transport->vprData + offset,
                                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                              opcode, 0U);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_CREATE_CONFIG: {
      uint8_t status = 0U;
#if VPR_CS_DEDICATED_IMAGE
      status = validate_create_config_command();
      if (status == 0U) {
        update_create_config_from_command();
      }
#endif
      size_t len = append_h4_command_status((uint8_t *)g_vpr_transport->vprData + offset,
                                            NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                            opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      if (status != 0U) {
        break;
      }
      len = build_config_complete_payload(payload, sizeof(payload), conn_handle);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_CONFIG_COMPLETE, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_REMOVE_CONFIG: {
      uint8_t status = 0U;
      uint8_t removed_config_id = 0U;
#if VPR_CS_DEDICATED_IMAGE
      bool removed_active_config = false;
      status = validate_remove_config_command();
      if (status == 0U) {
        removed_config_id = g_host_transport->hostData[6];
        removed_active_config = (removed_config_id == g_cs_config_id);
        if (removed_active_config) {
          clear_active_config_selection();
        }
        clear_cs_slots_for_config(removed_config_id);
        if (!any_cs_slot_in_use()) {
          clear_active_cs_state();
        } else if (removed_active_config && !activate_first_stored_config_slot()) {
          clear_active_cs_state();
        }
      }
#endif
      size_t len = append_h4_command_complete((uint8_t *)g_vpr_transport->vprData + offset,
                                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                              opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      if (status != 0U) {
        break;
      }
      len = build_remove_config_complete_payload(payload, sizeof(payload), conn_handle,
#if VPR_CS_DEDICATED_IMAGE
                                                 removed_config_id
#else
                                                 1U
#endif
      );
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_CONFIG_COMPLETE, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_SECURITY_ENABLE: {
      uint8_t status = 0U;
#if VPR_CS_DEDICATED_IMAGE
      vpr_cs_config_slot_t *slot = NULL;
      status = validate_security_enable_command();
#endif
      size_t len = append_h4_command_status((uint8_t *)g_vpr_transport->vprData + offset,
                                            NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                            opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      if (status != 0U) {
        break;
      }
#if VPR_CS_DEDICATED_IMAGE
      g_cs_security_enabled = 1U;
      slot = find_cs_slot(g_cs_config_id);
      if (slot != NULL) {
        slot->securityEnabled = 1U;
      }
#endif
      len = build_security_complete_payload(payload, sizeof(payload), conn_handle);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_SECURITY_ENABLE_COMPLETE, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_SET_PROCEDURE_PARAMETERS: {
      uint8_t status = 0U;
#if VPR_CS_DEDICATED_IMAGE
      status = validate_set_procedure_params_command();
      if (status == 0U) {
        update_procedure_params_from_command();
      }
#endif
      size_t len = append_h4_command_complete((uint8_t *)g_vpr_transport->vprData + offset,
                                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                              opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_PROCEDURE_ENABLE: {
      uint8_t status = 0U;
      uint8_t enable = 0U;
#if VPR_CS_DEDICATED_IMAGE
      status = validate_procedure_enable_command();
      if (g_host_transport->hostLen >= 8U) {
        const uint8_t requested_config_id = g_host_transport->hostData[6];
        vpr_cs_config_slot_t *slot = find_cs_slot(requested_config_id);
        const bool slot_in_previous = (slot == &g_cs_previous_slot);
        enable = g_host_transport->hostData[7];
        if (status == 0U && enable != 0U && requested_config_id != g_cs_config_id) {
          if (slot_in_previous) {
            slot = promote_previous_slot_to_primary(true);
            if (slot == NULL || !load_active_state_from_slot(slot)) {
              status = BLE_CS_HCI_STATUS_INVALID_PARAMS;
            } else {
              clear_active_runtime_state();
            }
          } else {
            (void)activate_stored_config_slot(requested_config_id, true);
            slot = find_cs_slot(requested_config_id);
          }
        } else if (status == 0U && slot != NULL) {
          if (enable != 0U && slot_in_previous) {
            slot = promote_previous_slot_to_primary(true);
            if (slot == NULL) {
              status = BLE_CS_HCI_STATUS_INVALID_PARAMS;
            }
          }
          if (status == 0U) {
            (void)load_active_state_from_slot(slot);
          }
        }
        if (enable == 0U) {
          g_cs_procedure_enabled = 0U;
          g_pending_cs_result_stage = 0U;
          g_cs_next_procedure_heartbeat = 0U;
          g_cs_next_subevent_heartbeat = 0U;
          g_cs_next_peer_stage_heartbeat = 0U;
          g_cs_next_chunk_stage_heartbeat = 0U;
          g_cs_last_interval_selector = 0U;
          g_cs_last_peer_gap_ticks = 0U;
          g_cs_active_subevent_index = 0U;
          g_cs_local_chunk_start_step = 0U;
          g_cs_peer_chunk_start_step = 0U;
        } else if (status == 0U) {
          g_cs_procedure_enabled = 1U;
          g_cs_procedure_counter = 1U;
          g_cs_active_subevent_index = 0U;
          g_pending_cs_result_stage = 1U;
          g_cs_next_procedure_heartbeat = 0U;
          g_cs_next_subevent_heartbeat = 0U;
          g_cs_next_peer_stage_heartbeat = 0U;
          g_cs_next_chunk_stage_heartbeat = 0U;
          g_cs_last_interval_selector = 0U;
          g_cs_last_peer_gap_ticks = 0U;
          g_cs_local_chunk_start_step = current_demo_subevent_start_step(0U);
          g_cs_peer_chunk_start_step = current_demo_subevent_start_step(0U);
        }
      }
#endif
      size_t len = append_h4_command_status((uint8_t *)g_vpr_transport->vprData + offset,
                                            NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                            opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      if (status != 0U) {
        break;
      }
      len = build_procedure_enable_complete_payload(payload, sizeof(payload), conn_handle);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_PROCEDURE_ENABLE_COMPLETE, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      if (enable != 0U) {
        g_pending_cs_result_stage = 1U;
        g_cs_next_peer_stage_heartbeat = 0U;
        g_cs_next_chunk_stage_heartbeat = 0U;
        g_cs_last_interval_selector = 0U;
        g_cs_last_peer_gap_ticks = 0U;
        g_cs_local_chunk_start_step = 0U;
        g_cs_peer_chunk_start_step = 0U;
      }
      break;
    }
#if !VPR_CS_DEDICATED_IMAGE
    case VPR_HCI_OP_VENDOR_PING: {
      size_t len = build_vendor_ping_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_GET_TRANSPORT_INFO: {
      size_t len = build_vendor_info_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_FNV1A32: {
      size_t len = build_vendor_fnv1a_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_GET_CAPABILITIES: {
      size_t len = build_vendor_capabilities_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_CRC32: {
      size_t len = build_vendor_crc32_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_CRC32C: {
      size_t len = build_vendor_crc32c_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_TICKER_CONFIGURE: {
      size_t len = build_vendor_ticker_configure_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_TICKER_READ_STATE: {
      size_t len = build_vendor_ticker_state_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_ENTER_HIBERNATE: {
      size_t len = build_vendor_enter_hibernate_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_TICKER_EVENT_CONFIGURE: {
      size_t len = build_vendor_ticker_event_configure_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_LEGACY_ADV_CONFIGURE: {
      size_t len =
          build_vendor_ble_legacy_adv_configure_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_LEGACY_ADV_READ_STATE: {
      size_t len = build_vendor_ble_legacy_adv_state_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_LEGACY_ADV_WRITE_DATA: {
      size_t len =
          build_vendor_ble_legacy_adv_write_data_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_LEGACY_ADV_READ_DATA: {
      size_t len = build_vendor_ble_legacy_adv_data_payload(payload, sizeof(payload), 0x00U);
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_CONNECTION_CONFIGURE: {
      size_t len =
          build_vendor_ble_connection_configure_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_CONNECTION_READ_STATE: {
      size_t len = build_vendor_ble_connection_state_payload(payload, sizeof(payload), 0x00U);
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_CONNECTION_DISCONNECT: {
      size_t len =
          build_vendor_ble_connection_disconnect_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_CS_LINK_CONFIGURE: {
      size_t len =
          build_vendor_ble_cs_link_configure_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_CS_LINK_READ_STATE: {
      size_t len = build_vendor_ble_cs_link_state_payload(payload, sizeof(payload), 0x00U);
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
#endif
    default:
      return false;
  }

  g_vpr_transport->vprLen = (uint32_t)offset;
  return true;
}

